// patchData.js

const patchData = [
  {
    date: "2024-02-28",
    patches: [
      '그룹 생성, 그룹 참여, 초대하기 기능 수정',
      '편집 기능 수정, 그룹 설정기능 추가',
      '그룹 나가기 기능 추가'
    ],
  },
  {
    date: "2024-02-22",
    patches: [
      '그룹 생성,참여 ui 변경'
    ],
  },
  {
    date: "2024-02-21",
    patches: [
      '페이지 메인 틀작업 진행',
      '주간숙제 페이지 초기화 기능 추가',
    ],
  },
  {
    date: "2024-01-30",
    patches: [
      "카제로스 레이드 정보 추가",
      "카제로스 탭 선택시 카제로스 레이드 데이터가 보이게 수정",
    ],
  },
  {
    date: "2024-01-26",
    patches: [
      "4관문 활성화 버튼 추가",
      "다른 사용자와 그룹 공유기능 추가",
      "웹에서 데이터가 실시간변경으로 보이지않던 현상수정",
      "레이드 스케줄표 상단고정 추가"
    ],
  },
  {
    date: "2024-01-25",
    patches: [
      "메테오 계산기 삭제",
      "하드, 노말 난이도에 따른 관문 색깔변경",
      "골드 받는 레이드의 관문만 보기버튼 추가"
    ],
  },
  {
    date: "2024-01-24",
    patches: [
      "레이드 스케줄 표 ui 개선",
      "레이드 탭 생성",
      "레이드 완료 체크를 관문마다 체크할수있게 변경"
    ],
  },
  {
    date: "2024-01-23",
    patches: [
      "페이지 ui 개선",
      "구글 로그인 기능 추가",
      "레이드 그룹 생성 기능 추가"
    ],
  },
  {
    date: "2023-09-28",
    patches: [
      "쌀계산기 수렵, 낚시, 고고학 이윤계산 추가"
    ],
  },
  {
    date: "2023-09-27",
    patches: [
      "안맞는 레이드 골드 수정",
      "아브렐슈드 4관문 on/off 버튼 추가",
      "아브렐슈드 4관문 입장에 따른 상위골드 레이드 변환"
    ],
  },
  {
    date: "2023-09-13",
    patches: [
      "수요일 오전 1시마다 데이터값 초기화",
      "카멘 레이드 데이터 추가 노말 13000골, 하드 21000골"
    ],
  },
  {
    date: "2023-09-12",
    patches: [
      "메테오계산기 페이지 추가",
      "파메, 노메 타일 각각 돌아가도록 수정",
      "타이머 실행시 버튼 비활성화",
    ],
  },
  {
    date: "2023-09-08",
    patches: [
      "로고 이미지 추가",
      "페이지 네이션 기능 추가 (부트스트랩 페이지 네이션인데 스타일 커스텀이 불가능함 수정해야됨)",
      "패치로그 페이지 추가",

    ],
  },
  {
    date: "2023-09-07",
    patches: ["편집버튼에서 초기값으로 되돌리는 버튼 기능 추가"],
  },
];

export default patchData;
